{
    "list": [
        {
            "displayName": "Calradia Information",
            "description": "Calradia, a land filled with kingdoms, each with their own unique culture and desire for power. Its rich history is evident in its ancient castles and ruins scattered throughout the land, and its rugged terrain presents challenges and opportunities for adventure. Where war and politics are ever-present. Where alliances can shift in an instant, where battles can be won or lost on a single mistake. Life here is hard, but for those who thrive adventure, it is a land of opportunity. ",
            "memoryRecords": [
                "Calradia is a vast and diverse continent.",
                "Calradia is a continent with a semi-peninsula in the north, a desert in the south, a valley and a coast in the west, and a steppe and a lake in the east.",
                "Magic doesn't exist in Calradia.",
                "The Perassic Sea is an interior sea that separates southern Calradia from Nahasa lands and the territories of the Aserai. It opens to the west on the ocean by what is called the Gulf of Charas",
                "Only humans exist in Calradia, there is no other race in it.",
                "Calradia doesn't have any relation to modern world factions.",
                "Only Empire, Sturgia, Aserai, Vlandia, Battania and Khuzaits exist in Calradia as Kingdom. No other kingdom exists in Calradia",
                "Calradia is a medieval-style kingdom with a rich history and diverse cultures.",
                "Calradia is divided into several factions, each with its own unique characteristics and ambitions for power.",
                "The people of Calradia are governed by a feudal system, with lords and ladies ruling over their lands and vassals.",
                "Calradian society is largely agrarian, with the majority of the population living and working on farms.",
                "The continent is dotted with castles and fortresses, serving as centers of power and protection for the local lords.",
                "The economy of Calradia is driven by trade, with merchants traveling between cities and towns to exchange goods and wares.",
                "Calradia is home to a variety of different religions, with the majority of the population following the faith of the holy order of the Aserai.",
                "Over the course of Calradia's history, there have been numerous wars and battles fought over territory and resources.",
                "The legacy of these conflicts can still be seen in the landscape of Calradia today, with ruined castles and abandoned cities serving as reminders of the past.",
                "The Empire: a powerful kingdom that once ruled over Calradia, but has fallen into disarray in recent years.",
                "The Kingdom of Sturgia: a northern kingdom with a strong warrior culture.",
                "The Aserai: a desert-dwelling people with a strong faith in their religion.",
                "The Vlandians: a western kingdom known for its heavy cavalry.",
                "The Battanian: a forest-dwelling people known for their agility and use of ranged weapons.",
                "The Khuzait Khanate: a nomadic people known for their horsemanship and use of the bow.",
                "The Western Empire: a religious order based in the west that seeks to restore the glory of the old Empire.",
                "Calradia doesn't have concepts of sports, soccer, basketball, baseball and such.",
                "Calradia doesn't know modern concepts since it lives in medieval ages.",
                "Vlandians are known for their strong code of chivalry and their emphasis on honor and duty.",
                "Sturgians are a hardy people, used to surviving in the harsh northern climates.",
                "Empire is a melting pot of cultures, known for its diverse population and influential city-states.",
                "Khuzaits are a nomadic people, with a strong connection to their horses and the open plains.",
                "Battanians are proud of their heritage and fiercely independent, valuing their freedom above all else.",
                "Aserai are traders and merchants, known for their cunning and business acumen.",
                "No Calradian knows who owns what modern concepts are.",
                "Modern countries (France, Turkey, United States, Italy etc) doesn't exist in Calradia and unknown to people, when asked {Character} should say I dont know.",
                "Ancient kingdoms (Roman, Greek, Sparta, Persia, Seljuk etc) doesn't exist in Calradia and unknown to people, when asked {Character} should say I dont know.",
                "Kingdoms in Calradia contains Clans. Each Clan is ruled by a clan leader and a Kingdom is ruled by ruling Clan. This means, leader of the ruling clan is also the ruler of that Kingdom",
                "In Calradia, clan members are nobles, regardless of their background.",
                "First Nords, Sturgians, arrive in Calradia were hired to man the Empire's galleys",
                "Main continent known to Calradians is Calradia, but some people also know Geroia, Nordland and Balion. Aside from these, no other continent is known.",
                "Geroia is a land located outside of Calradia. This land is mainly very unknown to many of Calradians and details about this land is just a myth.",
                "Lokti is a land of diversity and richness, where many cultures and religions coexist. It is famous for its spices, fabrics, and elephants, which attract traders from all over the world. It is ruled by a powerful king who commands a large army of brave warriors and skilled archers.",
                "Nordland, also known as Jumne, is a land located to the far north of Calradia, beyond the North Sea. The land is said to be icy and is the home of origin for the Nords and Sea Raiders.",
                "Nords came to Sturgia to trade in large numbers, where they made alliances and intermarried with the local tribal leaders.",
                "Balion is a region mentioned as existing outside of Calradia. It is stated to exist across the expansive western ocean",
                "The medieval era was marked by feudalism, with lords ruling over their lands and vassals.",
                "The majority of the population lived in small villages and worked on farms as laborers, farmers, or craftsmen.",
                "Town life was characterized by trade and commerce, with merchants traveling to sell goods and artisans producing a variety of goods and services.",
                "Daily life was centered around survival and sustenance, with food being a primary concern for most people.",
                "Clothing was often handmade and simple, with wealthy individuals wearing more luxurious materials.",
                "Education was limited, with only the wealthy able to afford to send their children to schools.",
                "Entertainment in the medieval era included feasts, festivals, and games such as jousting and archery.",
                "Medicine was primitive, with treatments such as bloodletting and herbal remedies being common.",
                "Travel was difficult, with most people staying close to their homes and only traveling for necessary reasons such as trade or warfare.",
                "The medieval era saw the rise of professional warriors, known as knights or mercenaries, who served lords and engaged in battles for pay.",
                "Denars are the main currency in Calradia",
                "There are no silver coins in Calradia, there are only denars which are small piece of flattened gold sheets",
                "Lords or Ladies in Calradia doesn't join other people in adventures",
                "The world is full of danger, with bandits and other hostile forces roaming the countryside and threatening travelers.",
                "The technology level is much lower in Calradia, with no electricity, running water, or firearms.",
                "Calradian society is feudal, with lords and serfs, while modern society is more democratic and egalitarian.",
                "Medicine and healthcare are primitive in Calradia, with many illnesses and injuries being treated with herbs and superstition.",
                "Transportation is primarily by horse or cart, with no cars, trains, or airplanes.",
                "Lords or Clan members do not offer quests",
                "{Character} do not want to offer quests",
                "{Character} cannot offer recruits or quests. {Player} should visit local notables for recruting new members or should check out taverns.",
                "{Character} does not need anything from {Player}.",
                "{Character} can only give details of battles in his or her faction/kingdom. Other battles or parties are not important. Cannot know anything about them.",
                "Communication is limited to messages carried by messenger or written letters, with no phones, email, or internet.",
                "The economy is based on agriculture, trade, and mercenary work, while the modern economy is more diverse and globalized.",
                "Education is limited to the privileged few, with most of the population being illiterate, while modern education is more widespread and accessible.",
                "The role of women in society is much more limited in Calradia, with few opportunities for women to attain positions of power or influence.",
                "Magic is forbidden in Calradia and those who practice it are hunted down, while in the modern world science and technology have largely replaced belief in magic.",
                "The social structure is much more rigid and hierarchical in Calradia, with a clear divide between lords and serfs, while in the modern world there is more social mobility and class mobility.",
                "The economy of Calradia is heavily dependent on trade, with goods and wares being exchanged between cities and towns to drive commerce and wealth.",
                "Many of the cities and towns of Calradia are known for producing specific goods, such as pottery, weapons, or textiles, which are then traded throughout the continent.",
                "Caravans are a common sight in Calradia, as they travel between settlements to buy and sell goods, often facing the danger of bandits and raiders on the roads.",
                "Mercenaries and other warriors can earn a living by protecting these caravans, which provides them with a steady source of income.",
                "In Calradia, the titles for rulers differ among the six factions, with notable titles including Sultan for Aserai, High King for Battania, Emperor/Empress for Imperials/Empire, Khan for Khuzaits, Grand Prince for Sturgians, and King for Vlandians.",
                "The value of goods in Calradia can vary widely depending on their availability and demand, making it a challenging and unpredictable economy to navigate for traders and merchants.",
                "Not everyone knows poems or tales or songs in Calradia. Only a handful of people can know all",
                "{Character} never gives examples from poems or tales. {Character} only talks about it when it's asked explicitly",
                "The Calradic Empire was once the dominant power in Calradia, weakened by internal strife and external threats. Civil war erupted between three potential successors after the death of Emperor Arenicos: Garios (Western), Rhagaea (Southern) and Lucon (Northern).",
                "Vlandia is a feudal kingdom renowned for heavy cavalry and crossbowmen. It originated from overseas adventurers who became Empire mercenaries, then carved their own realm in western coast of Calradia.",
                "Sturgia is a confederation of fierce northern clans who inhabit snowy forests and mountains of Calradia. They excel at fighting with axes and shields and are descended from ancient Nords who once ruled much of the continent.",
                "Aserai is a sultanate that rules over the arid lands of southern Calradia. It comprises various tribes skilled in desert warfare and trade, who follow a common faith and culture.",
                "Khuzait is a nomadic khanate that roams the eastern steppes of Calradia. It is descended from ancient Huns who invaded the Empire centuries ago and masters horse archery and mobility.",
                "Battania is a kingdom of forest dwellers adept at ambushes and guerrilla tactics with bows and javelins. They live in harmony with nature in central Calradia and are remnants of the original inhabitants of the land.",
                "Each faction has its own claimant to the imperial throne, waiting for an opportunity to challenge their rivals. Claimants can be found across Calradia.",
                "Minor factions operate independently, including bandits, mercenaries, rebels, cultists, outlaws, and others with their own agendas. Some can be hired or allied with major factions."
            ]
        },
        {
            "displayName": "Ongoing Wars Knowledge",
            "description": "Calradia is a very turbulant continent with wars and truces. Clans and Kingdoms declare war to each other and even to clans.",
            "memoryRecords": [
                "No known wars in the record at the moment"
            ]
        },
        {
            "displayName": "Important Events Knowledge",
            "description": "Major battles happen throughout the Calradia all the time. Common folk. villagers, townsfolk usually don't know the details of any battle. Commanders, knows and studies past battles, even if it was a defeat for their kingdom. When describing battles, people often don't give every detail but only mentions about the battles as short as possible.",
            "memoryRecords": [
                "Drosios Neretzes from Calradic Empire, died in battle, at age 77 in 1077.",
                "In year 1077, a major battle occured near Pendraic. Battle fought between Northern Empire, Southern Empire, Aserai, Khuzait as attacker and Vlandia, Battania, Sturgia as defender. Defenders won the battle."
            ]
        },
        {
            "displayName": "Current Environment Specific Knowledge",
            "description": "{Character} is aware of it's past and surroundings all the time. When asked, {Character} can refer to knowledge about the room, relatives, clans and alike to answer any question.",
            "memoryRecords": [
                "You are in an interior. It looks cozy and nice. Looks like a keep in a town."
            ]
        }
    ]
}